ninetyninecats/app/views/cats/_req_tr.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  1 AS one FROM "cats"  WHERE "cats"."user_id" = $1 AND "cats"."id" = 1 LIMIT 1  [["user_id", 2]]
---
  <td><%= req.end_date %></td>
  <td><%= User.find(req.user_id).user_name %></td>
  <td>
    <% if req.pending? && current_user && current_user.cats.include?(@cat) %>