ninetyninecats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    @cat.user_id = current_user.id

    if @cat.save