ninetyninecats/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "session_token", "updated_at", "user_name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_name: user_params[:user_name], password: user_params[:password])
    unless user_params[:password] == user_params[:verify_password]
      flash.now[:errors] = @user.errors.full_messages
      render :new
      return
    end

    if @user.save